app/controllers/api/trips_controller.rb

SELECT  "trips".* FROM "trips" WHERE "trips"."company_id" = $1 AND (users.email LIKE '%test@test.com%') ORDER BY "trips"."id" ASC LIMIT $2  [["company_id", 1], ["LIMIT", 1]]
SELECT  "companies".* FROM "companies" ORDER BY "companies"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT  "trips".* FROM "trips" ORDER BY "trips"."id" ASC LIMIT $1 OFFSET $2  [["LIMIT", 1], ["OFFSET", 2]]
---
  def index
    @trips = []
    if current_api_user
      if current_api_user.company
        @trips = current_api_user.company.trips # Returning records of company belonging to user
      end
      if params[:start_time] && params[:end_time]
        @trips = @trips.where("start_time >= ? OR ? <= end_time", params[:start_time], params[:end_time])
        @trips = @trips.filter_by_vehicle(params[:vehicle]) if params[:vehicle].present?

SELECT  "trips".* FROM "trips" ORDER BY "trips"."id" DESC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "trips" ("distance", "user_id", "company_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["distance", "34"], ["user_id", 1], ["company_id", 1], ["created_at", "2018-03-18 16:00:09.853611"], ["updated_at", "2018-03-18 16:00:09.853611"]]
---
  def create
    trips = trip_params
    if trips.present?
      begin
        ActiveRecord::Base.transaction do
        trips[:trips].each do |trip|
          @trip_record = Trip.new
          @trip_record.vehicle_id =  trip[:vehicle_id] if trip[:vehicle_id]
          @trip_record.company_id = trip[:company_id] if trip[:company_id]
          @trip_record.user_id = trip[:user_id] if trip[:user_id]
          @trip_record.start_time = trip[:start_time] if trip[:start_time]
          @trip_record.end_time = trip[:end_time] if trip[:end_time]
          @trip_record.distance = trip[:distance] if trip[:distance]
          @trip_record.save!

SELECT  "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = $1 LIMIT $2  [["id", 32], ["LIMIT", 1]]
SELECT "trips".* FROM "trips" WHERE "trips"."vehicle_id" = $1  [["vehicle_id", 32]]
SELECT "trips"."distance" FROM "trips" WHERE "trips"."vehicle_id" = $1  [["vehicle_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def trips_summary
    @trips = []
    if params[:vehicle_id].present?
      vehicle = Vehicle.find_by_id(params[:vehicle_id])
      if !vehicle.nil?
        @trips = vehicle.trips
        if @trips.present?
          @total_distance = @trips.all.pluck(:distance).map(&:to_i).reduce(0, :+)
          render json: {message: @total_distance.to_s }, status: :ok
        else
          render json: {error: "trips not present for given vehicle"}, status: :bad_request
        end
      else
        render json: {error: "invalid_params", error_description: "Missing params"}, status: :bad_request
      end
    elsif params[:user_id].present?
      user = User.find_by_id(params[:user_id])